In [3]:
import pandas as pd

### Download the data and load it to Pandas. 

You can find them [here](https://drive.google.com/file/d/1NY6cmF9Shjw-dD7BD6bNmfcIVz-kQcFR/view?usp=sharing).

In [4]:
titles = pd.read_csv('titles.csv', index_col=None)
titles.head()

                     title  year
0           The Rising Son  1990
1  The Thousand Plane Raid  1969
2         Crucea de piatra  1993
3                  Country  2000
4               Gaiking II  2011

In [5]:
cast = pd.read_csv('cast.csv', index_col=None)
cast.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4   NaN
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

### What are the ten most common movie names of all time?

In [48]:
titles['title'].value_counts()[:10].sort_values(ascending=False)

Hamlet                  18
Carmen                  16
Macbeth                 15
Maya                    12
The Outsider            12
Freedom                 11
The Three Musketeers    11
Temptation              11
Othello                 11
Kismet                  11
Name: title, dtype: int64

In [45]:

n = 10
titles['title'].value_counts()[:n].index.tolist()

['Hamlet',
 'Carmen',
 'Macbeth',
 'The Outsider',
 'Maya',
 'Kismet',
 'Othello',
 'Temptation',
 'The Three Musketeers',
 'Freedom']

### Which three years in the 1930s saw the most films released?

In [57]:
q = titles[titles["year"].between(1930,1939)]
q["year"].value_counts().sort_index(ascending=False).head(3)

1939    1078
1938    1129
1937    1196
Name: year, dtype: int64

### Count the number of films that have been released in each decade over the history of cinema.

                                                 title  year
124505  Reproduction of the Corbett and Jeffries Fight  1899
177757                                      Miss Jerry  1894
215272                              The Startled Lover  1898

In [66]:
q = titles.groupby((titles["year"]//10)*10).count()
q

      title   year
year
1890      3      3
1900     37     37
1910   6512   6512
1920   8797   8797
1930  10097  10097
1940   8576   8576
1950  12711  12711
1960  17515  17515
1970  18714  18714
1980  20243  20243
1990  22225  22225
2000  38713  38713
2010  67977  67977
2020    210    210

### Count the number of "Hamlet" films made in each decade.

In [76]:
q=titles[titles['title'].str.contains("Hamlet")]
print(q)
q = titles.groupby((q["year"]//10)*10).count()
q

                                          title  year
4394            Dogg's Hamlet, Cahoot's Macbeth  2005
6009                                     Hamlet  1948
7670                  Hamlet: Prince of Denmark  1989
8582                                Hamlet (II)  2005
8865                                Hamlet (II)  2015
14317                     Green Eggs and Hamlet  1995
15183                            Hamlet Unbound  2012
15202             Hamlet: The Fall of a Sparrow  2017
17419                 Hamlet, Prince of Denmark  1997
24178                        Han, hun og Hamlet  1932
24284               Intikam Melegi/Kadin Hamlet  1976
37146                                  Hamlet_X  2003
39230                  Hamlet, Son of a Kingpin  2015
42266                               Hamlet (IV)  2016
44682                              Hamlet (III)  2007
45350                                    Hamlet  1990
46721                                    Hamlet  1910
62549                            Redneck Hamlet  2017
71152   The Tragedy of Hamlet Prince of Denmark  2007
72925                        A Sagebrush Hamlet  1919
83789                       Harry, Hamlet and I  2013
92146                                    Hamlet  1976
94355                                    Hamlet  1987
94554                                    Hamlet  2000
98086                                  Hamlet 2  2008
98554                                    Hamlet  1921
99398                        Han, hun og Hamlet  1922
102506      Predstava 'Hamleta' u Mrdusi Donjoj  1974
102919                                   Hamlet  2011
109367                            Hamlet Frezer  2016
113096                             Hamlet (III)  2016
114431                   Hamlet liikemaailmassa  1987
122704                                   Hamlet  1969
128388                                   Hamlet  1954
143184                            Hamlet A.D.D.  2014
151918                              Fuck Hamlet  1996
163471                              Hamlet (II)  2007
166410                                   Hamlet  1913
167861                            Zombie Hamlet  2012
168965                                   Hamlet  2015
172418                Hamlet the Vampire Slayer  2008
174293                                 Hamlet X  2004
176069                                   Hamlet  2009
182970                                   Hamlet  1964
192443                             H for Hamlet  1993
193914        Royal Shakespeare Company: Hamlet  2016
195089                           Hamlet's Ghost  2015
201291                                   Hamlet  1996
209878                                   Hamlet  1911
211393                           Kitchen Hamlet  2009
221479                                   Hamlet  1973
223568                                   Hamlet  2014
223618                   Hamlet in the Hamptons  2002
227105                              Hamlet (II)  1964

        title  year
year
1910.0      4     4
1920.0      2     2
1930.0      1     1
1940.0      1     1
1950.0      1     1
1960.0      3     3
1970.0      4     4
1980.0      3     3
1990.0      6     6
2000.0     13    13
2010.0     16    16

### Count the number of "Rustler" characters in each decade of the history of film.

### Count the number of "Hamlet" characters in each decade.

### What are the 11 most common character names in movie history?

### Who are the 10 people most often credited as "Herself" in film history?

### Who are the 10 people most often credited as "Himself" in film history?

### Which actors or actresses appeared in the most movies in the year 1945?

### Which actors or actresses appeared in the most movies in the year 1985?

### How many roles "Mammootty" has played in each year of his career.

### What are the 10 most frequent roles that start with the phrase "Patron in"?

### What are the 10 most frequent roles that start with the word "Science"?

### Count number of n-values of the roles that Judi Dench has played over her career.

### Count number of n-values of Cary Grant's roles through his career.

### Count number of n-value of the roles that Sidney Poitier has acted over the years.

### How many leading (n=1) roles were available to actors, and how many to actresses, in the 1950s?

### How many supporting (n=2) roles were available to actors, and how many to actresses, in the 1950s?